import datetime

major = (
    '信息与通信工程', '计算机', '国际学院', '网络空间安全', '经济管理', '人文', '理学', '电子工程', '自动化', '数字媒体与设计艺术', '现代邮政', '软件', '民族教育', '教务处',
    '光电信息')


def subs(string):
    s = string[6:-1]
    return s


class Record:
    record = {
        'bookName': "",  # 书名
        'reader': "",  # 借阅者
        'time': "",  # 借阅时间(2019,03,12)
        'status': "",  # 状态
        'place': ""  # 地点
    }

    def clear(self):
        self.record = {
            'bookName': "",  # 书名
            'reader': "",  # 借阅者
            'time': "",  # 借阅时间(2019,03,12)
            'status': "",  # 状态
            'place': ""  # 地点
        }


class Book:
    name = ''  # 书名
    lable = []  # 标签
    records = []  # 借阅记录
    author = ''  # 作者
    isbn = ''  # 书籍号
    impd = 0  # 出版年
    score = 0  # 评分
    heat_borrow = {'2017-01': 0, '2017-02': 0, '2017-03': 0, '2017-04': 0, '2017-05': 0, '2017-06': 0, '2017-07': 0,
                   '2017-08': 0, '2017-09': 0, '2017-10': 0, '2017-11': 0, '2017-12': 0, '2018-01': 0, '2018-02': 0,
                   '2018-03': 0, '2018-04': 0, '2018-05': 0, '2018-06': 0, '2018-07': 0, '2018-08': 0, '2018-09': 0,
                   '2018-10': 0, '2018-11': 0, '2018-12': 0}

    heat_return = {'2017-01': 0, '2017-02': 0, '2017-03': 0, '2017-04': 0, '2017-05': 0, '2017-06': 0,
                   '2017-07': 0, '2017-08': 0, '2017-09': 0, '2017-10': 0, '2017-11': 0, '2017-12': 0,
                   '2018-01': 0, '2018-02': 0, '2018-03': 0, '2018-04': 0, '2018-05': 0, '2018-06': 0,
                   '2018-07': 0, '2018-08': 0, '2018-09': 0, '2018-10': 0, '2018-11': 0, '2018-12': 0}

    college_borrow = {'自动化学院': 0, '信息与通信工程学院': 0, '现代邮政学院': 0, '网络空间安全学院': 0, '数字媒体与设计艺术学院': 0,
                      '软件学院': 0, '人文学院': 0, '民族教育学院': 0, '': 0, '经济管理学院': 0, '教务处': 0, '计算机学院': 0,
                      '国际学院': 0, '光电信息学院': 0, '电子工程学院': 0, '2018级信息与通信工程学院本专科生': 0,
                      '2018级网络空间安全学院本专科生': 0, '2018级计算机学院本专科生': 0, '2018级国际学院本专科生': 0, '2018级电子工程学院本专科生': 0,
                      '2017级自动化学院本专科生': 0, '2017级信息与通信工程学院本专科生': 0, '2017级网络空间安全学院本专科生': 0,
                      '2017级软件学院本专科生': 0, '2017级人文学院本专科生': 0, '2017级民族教育学院本专科生': 0, '2017级理学院本专科生': 0,
                      '2017级经济管理学院本专科生': 0, '2017级计算机学院本专科生': 0, '2017级国际学院本专科生': 0, '2017级电子工程学院本专科生': 0,
                      '2016级信息与通信工程学院本专科生': 0, '2015级信息与通信工程学院本专科生': 0, '2015级网络空间安全学院本专科生': 0,
                      '2015级数字媒体与设计艺术学院本专科生': 0, '2015级计算机学院本专科生': 0, '2014级自动化学院本专科生': 0}

    college_return = {'自动化学院': 0, '信息与通信工程学院': 0, '现代邮政学院': 0, '网络空间安全学院': 0, '数字媒体与设计艺术学院': 0,
                      '软件学院': 0, '人文学院': 0, '民族教育学院': 0, '理学院': 0, '经济管理学院': 0, '教务处': 0, '计算机学院': 0,
                      '国际学院': 0, '光电信息学院': 0, '电子工程学院': 0, '2018级信息与通信工程学院本专科生': 0,
                      '2018级网络空间安全学院本专科生': 0, '2018级计算机学院本专科生': 0, '2018级国际学院本专科生': 0, '2018级电子工程学院本专科生': 0,
                      '2017级自动化学院本专科生': 0, '2017级信息与通信工程学院本专科生': 0, '2017级网络空间安全学院本专科生': 0,
                      '2017级软件学院本专科生': 0, '2017级人文学院本专科生': 0, '2017级民族教育学院本专科生': 0, '2017级理学院本专科生': 0,
                      '2017级经济管理学院本专科生': 0, '2017级计算机学院本专科生': 0, '2017级国际学院本专科生': 0, '2017级电子工程学院本专科生': 0,
                      '2016级信息与通信工程学院本专科生': 0, '2015级信息与通信工程学院本专科生': 0, '2015级网络空间安全学院本专科生': 0,
                      '2015级数字媒体与设计艺术学院本专科生': 0, '2015级计算机学院本专科生': 0, '2014级自动化学院本专科生': 0}

    def clear(self):
        self.name = ''  # 书名
        self.lable = []  # 标签
        self.records = []  # 借阅记录
        self.author = ''  # 作者
        self.isbn = ''  # 书籍号
        self.impd = 0  # 出版年
        self.score = 0  # 评分
        self.heat_borrow = {'2017-01': 0, '2017-02': 0, '2017-03': 0, '2017-04': 0, '2017-05': 0, '2017-06': 0,
                            '2017-07': 0, '2017-08': 0, '2017-09': 0, '2017-10': 0, '2017-11': 0, '2017-12': 0,
                            '2018-01': 0, '2018-02': 0, '2018-03': 0, '2018-04': 0, '2018-05': 0, '2018-06': 0,
                            '2018-07': 0, '2018-08': 0, '2018-09': 0, '2018-10': 0, '2018-11': 0, '2018-12': 0}

        self.heat_return = {'2017-01': 0, '2017-02': 0, '2017-03': 0, '2017-04': 0, '2017-05': 0, '2017-06': 0,
                            '2017-07': 0, '2017-08': 0, '2017-09': 0, '2017-10': 0, '2017-11': 0, '2017-12': 0,
                            '2018-01': 0, '2018-02': 0, '2018-03': 0, '2018-04': 0, '2018-05': 0, '2018-06': 0,
                            '2018-07': 0, '2018-08': 0, '2018-09': 0, '2018-10': 0, '2018-11': 0, '2018-12': 0}

        self.college_borrow = {'自动化学院': 0, '信息与通信工程学院': 0, '现代邮政学院': 0, '网络空间安全学院': 0, '数字媒体与设计艺术学院': 0,
                               '软件学院': 0, '人文学院': 0, '民族教育学院': 0, '理学院': 0, '经济管理学院': 0, '教务处': 0, '计算机学院': 0,
                               '国际学院': 0, '光电信息学院': 0, '电子工程学院': 0, '2018级信息与通信工程学院本专科生': 0,
                               '2018级网络空间安全学院本专科生': 0, '2018级计算机学院本专科生': 0, '2018级国际学院本专科生': 0, '2018级电子工程学院本专科生': 0,
                               '2017级自动化学院本专科生': 0, '2017级信息与通信工程学院本专科生': 0, '2017级网络空间安全学院本专科生': 0,
                               '2017级软件学院本专科生': 0, '2017级人文学院本专科生': 0, '2017级民族教育学院本专科生': 0, '2017级理学院本专科生': 0,
                               '2017级经济管理学院本专科生': 0, '2017级计算机学院本专科生': 0, '2017级国际学院本专科生': 0, '2017级电子工程学院本专科生': 0,
                               '2016级信息与通信工程学院本专科生': 0, '2015级信息与通信工程学院本专科生': 0, '2015级网络空间安全学院本专科生': 0,
                               '2015级数字媒体与设计艺术学院本专科生': 0, '2015级计算机学院本专科生': 0, '2014级自动化学院本专科生': 0}

        self.college_return = {'自动化学院': 0, '信息与通信工程学院': 0, '现代邮政学院': 0, '网络空间安全学院': 0, '数字媒体与设计艺术学院': 0,
                               '软件学院': 0, '人文学院': 0, '民族教育学院': 0, '理学院': 0, '经济管理学院': 0, '教务处': 0, '计算机学院': 0,
                               '国际学院': 0, '光电信息学院': 0, '电子工程学院': 0, '2018级信息与通信工程学院本专科生': 0,
                               '2018级网络空间安全学院本专科生': 0, '2018级计算机学院本专科生': 0, '2018级国际学院本专科生': 0, '2018级电子工程学院本专科生': 0,
                               '2017级自动化学院本专科生': 0, '2017级信息与通信工程学院本专科生': 0, '2017级网络空间安全学院本专科生': 0,
                               '2017级软件学院本专科生': 0, '2017级人文学院本专科生': 0, '2017级民族教育学院本专科生': 0, '2017级理学院本专科生': 0,
                               '2017级经济管理学院本专科生': 0, '2017级计算机学院本专科生': 0, '2017级国际学院本专科生': 0, '2017级电子工程学院本专科生': 0,
                               '2016级信息与通信工程学院本专科生': 0, '2015级信息与通信工程学院本专科生': 0, '2015级网络空间安全学院本专科生': 0,
                               '2015级数字媒体与设计艺术学院本专科生': 0, '2015级计算机学院本专科生': 0, '2014级自动化学院本专科生': 0}

    def to_str(self):
        return str(self.name) + str(self.lable) + str(self.records) + str(self.author) + str(self.isbn) + str(
            self.impd) + str(self.score) + str(self.heat_borrow) + str(self.heat_return) + str(
            self.college_borrow) + str(self.college_return)

    def get_heat(self):
        for i in range(len(self.records)):
            var = self.records[i]['time'][0:7]
            if var != "'":
                if self.records[i]['status'] == '还书':
                    self.heat_return[var] += 1
                else:
                    self.heat_borrow[var] += 1

    def get_college(self):
        for i in range(len(self.records)):
            var = self.records[i]['college']
            if self.records[i]['status'] == '还书':
                self.college_return[var] += 1
            else:
                self.college_borrow[var] += 1


class Reader:
    student_num = ''  # 学号
    grade = 0  # 年级
    majoy_in = ''  # 专业
    records = []  # 借阅记录
    lable = []  # 标签
    heat_borrow = {'2017-01': 0, '2017-02': 0, '2017-03': 0, '2017-04': 0, '2017-05': 0, '2017-06': 0,
                   '2017-07': 0, '2017-08': 0, '2017-09': 0, '2017-10': 0, '2017-11': 0, '2017-12': 0,
                   '2018-01': 0, '2018-02': 0, '2018-03': 0, '2018-04': 0, '2018-05': 0, '2018-06': 0,
                   '2018-07': 0, '2018-08': 0, '2018-09': 0, '2018-10': 0, '2018-11': 0, '2018-12': 0}

    heat_return = {'2017-01': 0, '2017-02': 0, '2017-03': 0, '2017-04': 0, '2017-05': 0, '2017-06': 0,
                   '2017-07': 0, '2017-08': 0, '2017-09': 0, '2017-10': 0, '2017-11': 0, '2017-12': 0,
                   '2018-01': 0, '2018-02': 0, '2018-03': 0, '2018-04': 0, '2018-05': 0, '2018-06': 0,
                   '2018-07': 0, '2018-08': 0, '2018-09': 0, '2018-10': 0, '2018-11': 0, '2018-12': 0}

    def clear(self):
        self.student_num = ''
        self.grade = 0
        self.majoy_in = ''
        self.records = []
        self.lable = []
        self.heat_borrow = {'2017-01': 0, '2017-02': 0, '2017-03': 0, '2017-04': 0, '2017-05': 0, '2017-06': 0,
                            '2017-07': 0, '2017-08': 0, '2017-09': 0, '2017-10': 0, '2017-11': 0, '2017-12': 0,
                            '2018-01': 0, '2018-02': 0, '2018-03': 0, '2018-04': 0, '2018-05': 0, '2018-06': 0,
                            '2018-07': 0, '2018-08': 0, '2018-09': 0, '2018-10': 0, '2018-11': 0, '2018-12': 0}
        self.heat_return = {'2017-01': 0, '2017-02': 0, '2017-03': 0, '2017-04': 0, '2017-05': 0, '2017-06': 0,
                            '2017-07': 0, '2017-08': 0, '2017-09': 0, '2017-10': 0, '2017-11': 0, '2017-12': 0,
                            '2018-01': 0, '2018-02': 0, '2018-03': 0, '2018-04': 0, '2018-05': 0, '2018-06': 0,
                            '2018-07': 0, '2018-08': 0, '2018-09': 0, '2018-10': 0, '2018-11': 0, '2018-12': 0}

    def to_str(self):
        return str(self.student_num) + str(self.grade) + str(self.majoy_in) + \
               str(self.records) + str(self.lable)

    def get_heat(self):
        for i in range(len(self.records)):
            var = self.records[i]['time'][0:7]
            if var != "'":
                if self.records[i]['status'] == '预借借出' \
                        or self.records[i]['status'] == '借书' \
                        or self.records[i]['status'] == '续借':
                    self.heat_borrow[var] += 1
                else:
                    self.heat_return[var] += 1

    def get_label(self):
        for index in major:
            j = 0
            for i in range(len(self.majoy_in)):
                if self.majoy_in[i] != index[j]:
                    j = 0
                else:
                    j += 1
                if j == len(index) - 1:
                    self.lable.append(index)
                    break
            if j == len(index) - 1:
                break


class College:
    name = ''  # 学院名
